In [21]:
import pandas as pd

In [22]:
forum_users = {
    'UserID': [1, 2, 3, 4, 5],
    'Username': ['jane_smith', 'alex123', 'bob56', 'mark_wilson', 'test_name'],
    'Age': [18, 35, 25, 28, 45],
    'Joined Date': ['2034-01-01', '2034-02-15', '2034-04-25', '2034-06-21', '2034-09-15'],
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   UserID     Username  Age Joined Date  Total Posts  Reputation
0       1   jane_smith   18  2034-01-01          150         500
1       2      alex123   35  2034-02-15          230         720
2       3        bob56   25  2034-04-25           80         200
3       4  mark_wilson   28  2034-06-21          420         940
4       5    test_name   45  2034-09-15          310         500

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df.columns

Index(['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [25]:
df.columns.tolist()

['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [26]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [28]:
df.dtypes

UserID          int64
Username       object
Age             int64
Joined Date    object
Total Posts     int64
Reputation      int64
dtype: object

In [29]:
df.values

array([[1, 'jane_smith', 18, '2034-01-01', 150, 500],
       [2, 'alex123', 35, '2034-02-15', 230, 720],
       [3, 'bob56', 25, '2034-04-25', 80, 200],
       [4, 'mark_wilson', 28, '2034-06-21', 420, 940],
       [5, 'test_name', 45, '2034-09-15', 310, 500]], dtype=object)

In [30]:
type(df.values)

numpy.ndarray

In [31]:
df.head(3)

   UserID    Username  Age Joined Date  Total Posts  Reputation
0       1  jane_smith   18  2034-01-01          150         500
1       2     alex123   35  2034-02-15          230         720
2       3       bob56   25  2034-04-25           80         200

In [32]:
df.values[1, 1]

'alex123'

In [33]:
df.tail(2)

   UserID     Username  Age Joined Date  Total Posts  Reputation
3       4  mark_wilson   28  2034-06-21          420         940
4       5    test_name   45  2034-09-15          310         500

In [34]:
df.describe().round(2)

       UserID    Age  Total Posts  Reputation
count    5.00   5.00          5.0        5.00
mean     3.00  30.20        238.0      572.00
std      1.58  10.28        133.3      276.62
min      1.00  18.00         80.0      200.00
25%      2.00  25.00        150.0      500.00
50%      3.00  28.00        230.0      500.00
75%      4.00  35.00        310.0      720.00
max      5.00  45.00        420.0      940.00